{
  "es": {
    "nombre": "Michael Llorens",
    "ver-cv": "Ver CV",
    "profesion": "Desarrollador Web Full Stack | Estudiante DAW",
    "sobre_mi_titulo": "Sobre mí",
    "sobre_mi_texto1": "Soy Michael Llorens, Desarrollador Web Full Stack con formación sólida en Desarrollo de Aplicaciones Multiplataforma (DAM) y especialización actual en Desarrollo de Aplicaciones Web (DAW). Mi trayectoria profesional combina experiencia práctica en empresas tecnológicas con una formación técnica versátil que abarca desde el backend robusto hasta interfaces de usuario modernas.",
    "sobre_mi_texto2": "Mi stack actual incluye JavaScript/TypeScript, React, Next.js y Node.js en el frontend, Java y Spring Boot en el backend, y MongoDB/MySQL para gestión de datos. Tengo experiencia comprobada en desarrollo full-stack con autenticación segura (JWT), despliegue en entornos cloud (Vercel, MongoDB Atlas) y buenas prácticas de desarrollo. Durante mi formación en DAM, adquirí bases sólidas en programación orientada a objetos, desarrollo multiplataforma (Android, C++, Python) y arquitectura de software que complementan mi especialización web actual.",
    "sobre_mi_texto3": "Actualmente busco oportunidades de prácticas profesionales donde pueda contribuir en proyectos web full-stack reales, aplicar mis conocimientos técnicos en un entorno profesional y seguir creciendo como desarrollador. Mi enfoque es crear soluciones eficientes, mantenibles y centradas en la experiencia del usuario, aprendiendo continuamente de cada proyecto y desafío técnico.",
    "tecnologias_titulo": "Tecnologías",
    "experiencia_titulo": "Experiencia",
    "experiencia_puesto_freelance": "Desarrollador Web",
    "experiencia_fecha_freelance": "Agosto 2023 - Actualidad",
    "experiencia_descripcion_freelance": "Desarrollo full-stack de sitios web personalizados para clientes particulares y pequeñas empresas. Creo interfaces modernas y responsivas con HTML5, CSS3, JavaScript y React, implemento funcionalidades backend con Node.js y Express, y gestiono bases de datos (MySQL, MongoDB). Realizo optimización de rendimiento, integración de APIs externas y mejora de la experiencia de usuario.",
    "experiencia_puesto_ecommalia": "Desarrollador Web en Prácticas (FCT)",
    "experiencia_fecha_ecommalia": "Marzo 2024 - Agosto 2024",
    "experiencia_descripcion_ecommalia": "Desarrollo y mantenimiento de plataformas eCommerce basadas en Prestashop y WordPress. Instalación y personalización de módulos, optimización de rendimiento, testing y debugging en entornos profesionales. Gestión de datos en sistemas como Odoo y Amazon para mejorar operaciones de venta y experiencia de usuario.",
    "proyectos_titulo": "Proyectos",
    "proyecto_goodfood_descripcion": "GoodFood es una app de recetas donde los usuarios pueden descubrir, compartir y gestionar platos fácilmente. Permite filtrar por origen, editar recetas y muestra información nutricional gracias a la API de Open Food Facts.",
    "proyecto_kinepolis_descripcion": "Proyecto que simula un sistema de reservas de cine, desarrollado en Java. Implementa comunicación cliente-servidor mediante sockets, mostrando la lógica de gestión de plazas y concurrencia de usuarios.",
    "proyecto_robots_descripcion": "Juego de robots desarrollado en Odoo utilizando Python, con implementación de lambdas, tareas cron programadas y herencia de modelos como res.partner para integrar funcionalidades avanzadas del ERP.",
    "proyecto_bolas_descripcion": "Juego desarrollado en Qt donde el jugador controla una bola que debe esquivar otras bolas en movimiento. El objetivo es sobrevivir el mayor tiempo posible, mejorando reflejos y coordinación.",
    "estudios_titul": "Estudios",
    "estudios_titulacion_daw": "Grado Superior en Desarrollo de Aplicaciones Web (DAW)",
    "estudios_fecha_daw": "2024 - Presente",
    "estudios_descripcion_daw": "Especialización en desarrollo web full-stack. Asignaturas: Desarrollo Web en entorno servidor, Despliegue de aplicaciones Web, Desarrollo Web en entorno cliente, Desarrollo de interfaces Web. Profundizando en frameworks modernos (React, Next.js), backend (Node.js, Express), bases de datos (MongoDB, MySQL), autenticación (JWT), y despliegue en entornos cloud.",
    "estudios_titulacion_dam": "Grado Superior en Desarrollo de Aplicaciones Multiplataforma (DAM)",
    "estudios_tiempo_dam": "2022 - 2024",
    "estudios_descripcion_dam": "Formación técnica sólida en programación orientada a objetos, desarrollo multiplataforma (Java, Kotlin, Python, C++), aplicaciones Android, bases de datos relacionales y NoSQL, APIs REST, Spring Boot, Odoo, Firebase, y buenas prácticas de desarrollo.",
    "footer": "&copy; 2025 Michael Llorens. Todos los derechos reservados."
  },
  "en": {
    "nombre": "Michael Llorens",
    "ver-cv": "See CV",
    "profesion": "Full Stack Web Developer | DAW Student",
    "sobre_mi_titulo": "About Me",
    "sobre_mi_texto1": "I'm Michael Llorens, a Full Stack Web Developer with solid training in Multiplatform Application Development (DAM) and current specialization in Web Application Development (DAW). My professional trajectory combines practical experience in technology companies with versatile technical training spanning from robust backend to modern user interfaces.",
    "sobre_mi_texto2": "My current stack includes JavaScript/TypeScript, React, Next.js, and Node.js on the frontend, Java and Spring Boot on the backend, and MongoDB/MySQL for data management. I have proven experience in full-stack development with secure authentication (JWT), deployment in cloud environments (Vercel, MongoDB Atlas), and development best practices. During my DAM training, I acquired solid foundations in object-oriented programming, multiplatform development (Android, C++, Python), and software architecture that complement my current web specialization.",
    "sobre_mi_texto3": "I'm currently seeking professional internship opportunities where I can contribute to real full-stack web projects, apply my technical knowledge in a professional environment, and continue growing as a developer. My approach is to create efficient, maintainable solutions centered on user experience, continuously learning from each project and technical challenge.",
    "tecnologias_titulo": "Technologies",
    "experiencia_titulo": "Experience",
    "experiencia_puesto_freelance": "Web Developer",
    "experiencia_fecha_freelance": "August 2023 - Present",
    "experiencia_descripcion_freelance": "Full-stack development of custom websites for individual clients and small businesses. I create modern and responsive interfaces with HTML5, CSS3, JavaScript, and React, implement backend functionalities with Node.js and Express, and manage databases (MySQL, MongoDB). I perform performance optimization, external API integration, and user experience improvements.",
    "experiencia_puesto_ecommalia": "Web Developer Intern (FCT)",
    "experiencia_fecha_ecommalia": "March 2024 - August 2024",
    "experiencia_descripcion_ecommalia": "Development and maintenance of eCommerce platforms based on Prestashop and WordPress. Module installation and customization, performance optimization, testing and debugging in professional environments. Data management in systems like Odoo and Amazon to improve sales operations and user experience.",
    "proyectos_titulo": "Projects",
    "proyecto_goodfood_descripcion": "GoodFood is a recipe app where users can easily discover, share, and manage dishes. It allows filtering by origin, editing recipes, and displays nutritional information thanks to the Open Food Facts API.",
    "proyecto_kinepolis_descripcion": "Project simulating a cinema booking system, developed in Java. Implements client-server communication through sockets, showcasing seat management logic and user concurrency.",
    "proyecto_robots_descripcion": "Robot game developed in Odoo using Python, with implementation of lambdas, scheduled cron tasks, and model inheritance such as res.partner to integrate advanced ERP functionalities.",
    "proyecto_bolas_descripcion": "Game developed in Qt where the player controls a ball that must dodge other moving balls. The goal is to survive as long as possible, improving reflexes and coordination.",
    "estudios_titul": "Education",
    "estudios_titulacion_daw": "Higher Degree in Web Application Development (DAW)",
    "estudios_fecha_daw": "2024 - Present",
    "estudios_descripcion_daw": "Specialization in full-stack web development. Subjects: Web Development in server environment, Web Application Deployment, Web Development in client environment, Web Interface Development. Deepening in modern frameworks (React, Next.js), backend (Node.js, Express), databases (MongoDB, MySQL), authentication (JWT), and cloud deployment.",
    "estudios_titulacion_dam": "Higher Degree in Multiplatform Application Development (DAM)",
    "estudios_tiempo_dam": "2022 - 2024",
    "estudios_descripcion_dam": "Solid technical training in object-oriented programming, multiplatform development (Java, Kotlin, Python, C++), Android applications, relational and NoSQL databases, REST APIs, Spring Boot, Odoo, Firebase, and development best practices.",
    "footer": "&copy; 2025 Michael Llorens. All rights reserved."
  }
}
