{
  "es": {
    "nombre": "Michael Llorens",
    "profesion": "Desarrollador Full Stack | Desarrollador Android y Web",
    "sobre_mi_titulo": "Sobre mí",
    "sobre_mi_texto1": "Soy Michael Llorens Barberá, desarrollador Full Stack con formación en Desarrollo de Aplicaciones Multiplataforma. Cuento con experiencia en desarrollo web y móvil, trabajando con tecnologías como Java, Kotlin, PHP, Firebase, Spring Boot, HTML, CSS, JavaScript y bases de datos MySQL, lo que me permite crear aplicaciones sólidas y completas.",
    "sobre_mi_texto2": "Entre mis habilidades técnicas, destaco la capacidad para manejar programación concurrente y comunicación cliente-servidor, adquirida al desarrollar sistemas que gestionan múltiples usuarios simultáneos, garantizando la integridad y consistencia de los datos en tiempo real.",
    "sobre_mi_texto3": "También tengo experiencia en integración de APIs externas y programación en Python para entornos de gestión empresarial como Odoo, aportando soluciones adaptadas a las necesidades del negocio. Me apasiona desarrollar software eficiente, mantenible y centrado en ofrecer una excelente experiencia de usuario.",
    "tecnologias_titulo": "Tecnologías",
    "experiencia_titulo": "Experiencia",
    "experiencia_puesto_freelance": "Desarrollador Web",
    "experiencia_fecha_freelance": "Agosto 2023 - Actualidad",
    "experiencia_descripcion_freelance": "Creación de sitios web para clientes particulares, desarrollando interfaces modernas y funcionalidad backend personalizada. Trabajo con HTML, CSS, JavaScript, PHP y MySQL.",
    "experiencia_puesto_ecommalia": "Desarrollador Web en Prácticas",
    "experiencia_fecha_ecommalia": "Marzo 2024 - Agosto 2024",
    "experiencia_descripcion_ecommalia": "Realicé tareas de desarrollo y mantenimiento en sitios web basados en Prestashop y WordPress, seleccionando e instalando módulos personalizados según las necesidades, y gestionando la actualización de datos en sistemas como Odoo y Amazon para mejorar la gestión de ventas y la experiencia del usuario.",
    "proyectos_titulo": "Proyectos",
    "proyecto_goodfood_descripcion": "GoodFood es una app de recetas donde los usuarios pueden descubrir, compartir y gestionar platos fácilmente. Permite filtrar por origen, editar recetas y muestra información nutricional gracias a la API de Open Food Facts.",
    "proyecto_kinepolis_descripcion": "Proyecto que simula un sistema de reservas de cine, desarrollado en Java. Implementa comunicación cliente-servidor mediante sockets, mostrando la lógica de gestión de plazas y concurrencia de usuarios.",
    "proyecto_robots_descripcion": "Juego de robots desarrollado en Odoo utilizando Python, con implementación de lambdas, tareas cron programadas y herencia de modelos como res.partner para integrar funcionalidades avanzadas del ERP.",
    "proyecto_bolas_descripcion": "Juego desarrollado en Qt donde el jugador controla una bola que debe esquivar otras bolas en movimiento. El objetivo es sobrevivir el mayor tiempo posible, mejorando reflejos y coordinación.",
    "estudios_titul": "Estudios",
    "estudios_titulacion_daw": "Grado Superior en Desarrollo de Aplicaciones Web (DAW)",
    "estudios_fecha_daw": "Actualidad",
    "estudios_descripcion_daw": "Formación integral en el desarrollo y mantenimiento de aplicaciones web, abarcando lenguajes y tecnologías clave como HTML, CSS, JavaScript, PHP y bases de datos. Incluye el diseño de interfaces, programación backend, gestión de servidores y despliegue de aplicaciones, con énfasis en la calidad, seguridad y experiencia de usuario.",
    "estudios_titulacion_dam": "Grado Superior en Desarrollo de Aplicaciones Multiplataforma (DAM)",
    "estudios_tiempo_dam": "Sepiembre 2022 – Julio 2024",
    "estudios_descripcion_dam": "Formación especializada en desarrollo de software, abarcando programación en Java, Kotlin, Python, HTML, CSS, JavaScript y PHP. Desarrollo de aplicaciones móviles con Android Studio, diseño de interfaces gráficas con Qt, gestión de bases de datos con MySQL y SQLite, uso de APIs y frameworks como Spring Boot, así como experiencia práctica con herramientas como Firebase y Odoo.",
    "footer": "&copy; 2025 Michael Llorens. Todos los derechos reservados."

  },
  "en": {
    "nombre": "Michael Llorens",
    "profesion": "Full Stack Developer | Android and Web Developer",
    "sobre_mi_titulo": "About Me",
    "sobre_mi_texto1": "I'm Michael Llorens Barberá, a Full Stack developer with training in Multiplatform Application Development. I have experience in web and mobile development, working with technologies such as Java, Kotlin, PHP, Firebase, Spring Boot, HTML, CSS, JavaScript, and MySQL databases, which allows me to build solid and complete applications.",
    "sobre_mi_texto2": "Among my technical skills, I highlight my ability to handle concurrent programming and client-server communication, acquired by developing systems that manage multiple users simultaneously, ensuring data integrity and consistency in real-time.",
    "sobre_mi_texto3": "I also have experience integrating external APIs and programming in Python for business management environments like Odoo, providing solutions tailored to business needs. I am passionate about developing efficient, maintainable software focused on delivering an excellent user experience.",
    "tecnologias_titulo": "Technologies",
    "experiencia_titulo": "Experience",
    "experiencia_puesto_freelance": "Web Developer",
    "experiencia_fecha_freelance": "August 2023 - Present",
    "experiencia_descripcion_freelance": "Creation of websites for individual clients, developing modern interfaces and custom backend functionality. Working with HTML, CSS, JavaScript, PHP, and MySQL.",
    "experiencia_puesto_ecommalia": "Web Developer Intern",
    "experiencia_fecha_ecommalia": "March 2024 - August 2024",
    "experiencia_descripcion_ecommalia": "I performed development and maintenance tasks on websites based on Prestashop and WordPress, selecting and installing custom modules as needed, and managing data updates in systems such as Odoo and Amazon to improve sales management and user experience.",
    "proyectos_titulo": "Projects",
    "proyecto_goodfood_descripcion": "GoodFood is a recipe app where users can easily discover, share, and manage dishes. It allows filtering by origin, editing recipes, and displays nutritional information thanks to the Open Food Facts API.",
    "proyecto_kinepolis_descripcion": "Project simulating a cinema booking system, developed in Java. Implements client-server communication through sockets, showcasing seat management logic and user concurrency.",
    "proyecto_robots_descripcion": "Robot game developed in Odoo using Python, with implementation of lambdas, scheduled cron tasks, and model inheritance such as res.partner to integrate advanced ERP functionalities.",
    "proyecto_bolas_descripcion": "Game developed in Qt where the player controls a ball that must dodge other moving balls. The goal is to survive as long as possible, improving reflexes and coordination.",
    "estudios_titul": "Education",
    "estudios_titulacion_daw": "Higher Degree in Web Application Development (DAW)",
    "estudios_fecha_daw": "Currently",
    "estudios_descripcion_daw": "Comprehensive training in the development and maintenance of web applications, covering key languages and technologies such as HTML, CSS, JavaScript, PHP, and databases. Includes interface design, backend programming, server management, and application deployment, with emphasis on quality, security, and user experience.",
    "estudios_titulacion_dam": "Higher Degree in Multiplatform Application Development (DAM)",
    "estudios_tiempo_dam": "September 2022 – July 2024",
    "estudios_descripcion_dam": "Specialized training in software development, including programming in Java, Kotlin, Python, HTML, CSS, JavaScript, and PHP. Development of mobile applications with Android Studio, GUI design with Qt, database management with MySQL and SQLite, API usage and frameworks like Spring Boot, as well as hands-on experience with tools like Firebase and Odoo.",
    "footer": "&copy; 2025 Michael Llorens. All rights reserved."
}

}
